Tests/sysbench_results_r5a.4xlarge_20250606_015500.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Fri Jun  6 01:55:00 UTC 2025
Hostname: i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com
Instance Type: r5a.4xlarge
Operating System: Linux i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com 6.1.130-139.222.amzn2023.x86_64 #1 SMP PREEMPT_DYNAMIC Tue Mar 11 01:10:58 UTC 2025 x86_64 x86_64 x86_64 GNU/Linux
CPU Info: AMD EPYC 7571 AMD EPYC 7571
CPU Cores: 16
Memory: 124Gi
=====================================================================

[2025-06-06 01:55:00] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-06 01:55:00] Results will be saved to: sysbench_results_r5a.4xlarge_20250606_015500.txt
[2025-06-06 01:55:00] ================================================
[2025-06-06 01:55:00] Checking prerequisites...
[2025-06-06 01:55:00] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-06 01:55:00] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-06 01:55:01] Starting CPU benchmarks...
[2025-06-06 01:55:01] Detected 16 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 01:55:01] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 12075.50 lat (ms,95%): 0.08
[ 20s ] thds: 1 eps: 12137.61 lat (ms,95%): 0.08
[ 30s ] thds: 1 eps: 12120.61 lat (ms,95%): 0.08
[ 40s ] thds: 1 eps: 12096.89 lat (ms,95%): 0.08
[ 50s ] thds: 1 eps: 12130.60 lat (ms,95%): 0.08
[ 60s ] thds: 1 eps: 12143.70 lat (ms,95%): 0.08
[ 70s ] thds: 1 eps: 12142.78 lat (ms,95%): 0.08
[ 80s ] thds: 1 eps: 12125.72 lat (ms,95%): 0.08
[ 90s ] thds: 1 eps: 12141.20 lat (ms,95%): 0.08
[ 100s ] thds: 1 eps: 12145.60 lat (ms,95%): 0.08
[ 110s ] thds: 1 eps: 12107.70 lat (ms,95%): 0.08
CPU speed:
    events per second: 12124.63

Throughput:
    events/s (eps):                      12124.6304
    time elapsed:                        120.0003s
    total number of events:              1454959

Latency (ms):
         min:                                    0.08
         avg:                                    0.08
         max:                                    0.89
         95th percentile:                        0.08
         sum:                               119786.08

Threads fairness:
    events (avg/stddev):           1454959.0000/0.00
    execution time (avg/stddev):   119.7861/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 01:57:01] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 16 eps: 103813.51 lat (ms,95%): 0.16
[ 20s ] thds: 16 eps: 103822.03 lat (ms,95%): 0.16
[ 30s ] thds: 16 eps: 103812.46 lat (ms,95%): 0.16
[ 40s ] thds: 16 eps: 103834.13 lat (ms,95%): 0.16
[ 50s ] thds: 16 eps: 103766.11 lat (ms,95%): 0.16
[ 60s ] thds: 16 eps: 103843.43 lat (ms,95%): 0.16
[ 70s ] thds: 16 eps: 103852.50 lat (ms,95%): 0.16
[ 80s ] thds: 16 eps: 103844.21 lat (ms,95%): 0.16
[ 90s ] thds: 16 eps: 103894.68 lat (ms,95%): 0.16
[ 100s ] thds: 16 eps: 103866.19 lat (ms,95%): 0.16
[ 110s ] thds: 16 eps: 103799.61 lat (ms,95%): 0.16
CPU speed:
    events per second: 103831.26

Throughput:
    events/s (eps):                      103831.2583
    time elapsed:                        120.0005s
    total number of events:              12459799

Latency (ms):
         min:                                    0.08
         avg:                                    0.15
         max:                                   51.39
         95th percentile:                        0.16
         sum:                              1917090.28

Threads fairness:
    events (avg/stddev):           778737.4375/3918.27
    execution time (avg/stddev):   119.8181/0.01

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-06 01:59:01] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-06 01:59:01] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-06 02:01:42] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 02:01:42] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 5628.59 qps: 90073.23 (r/w/o: 78814.65/0.00/11258.58) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 5892.43 qps: 94276.46 (r/w/o: 82491.50/0.00/11784.96) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 5877.08 qps: 94037.24 (r/w/o: 82282.97/0.00/11754.27) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 5907.01 qps: 94508.24 (r/w/o: 82694.21/0.00/11814.03) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 5907.63 qps: 94524.27 (r/w/o: 82709.01/0.00/11815.26) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 5918.20 qps: 94687.82 (r/w/o: 82851.62/0.00/11836.20) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 5987.43 qps: 95802.80 (r/w/o: 83827.85/0.00/11974.95) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 6049.16 qps: 96785.26 (r/w/o: 84686.84/0.00/12098.42) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 6186.38 qps: 98982.60 (r/w/o: 86609.85/0.00/12372.75) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 6400.19 qps: 102402.54 (r/w/o: 89602.26/0.00/12800.28) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 6398.00 qps: 102367.25 (r/w/o: 89571.14/0.00/12796.11) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 6397.11 qps: 102349.32 (r/w/o: 89555.61/0.00/12793.72) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            10157196
        write:                           0
        other:                           1451028
        total:                           11608224
    transactions:                        725514 (6045.21 per sec.)
    queries:                             11608224 (96723.29 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      6045.2054
    time elapsed:                        120.0148s
    total number of events:              725514

Latency (ms):
         min:                                    1.95
         avg:                                    2.64
         max:                                   67.85
         95th percentile:                        4.03
         sum:                              1918331.29

Threads fairness:
    events (avg/stddev):           45344.6250/461.35
    execution time (avg/stddev):   119.8957/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 02:03:43] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1545.04 qps: 9278.25 (r/w/o: 0.00/6186.56/3091.68) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1044.80 qps: 6268.82 (r/w/o: 0.00/4179.21/2089.61) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1054.60 qps: 6327.60 (r/w/o: 0.00/4218.40/2109.20) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 863.20 qps: 5179.20 (r/w/o: 0.00/3452.80/1726.40) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1247.20 qps: 7483.20 (r/w/o: 0.00/4988.80/2494.40) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 747.90 qps: 4487.40 (r/w/o: 0.00/2991.60/1495.80) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 1293.30 qps: 7759.78 (r/w/o: 0.00/5173.19/2586.59) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 838.40 qps: 5030.41 (r/w/o: 0.00/3353.61/1676.80) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 936.80 qps: 5620.80 (r/w/o: 0.00/3747.20/1873.60) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1186.30 qps: 7117.80 (r/w/o: 0.00/4745.20/2372.60) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 756.80 qps: 4540.80 (r/w/o: 0.00/3027.20/1513.60) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1236.10 qps: 7416.60 (r/w/o: 0.00/4944.40/2472.20) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           510092
        other:                           255046
        total:                           765138
    transactions:                        127523 (1062.60 per sec.)
    queries:                             765138 (6375.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1062.6034
    time elapsed:                        120.0100s
    total number of events:              127523

Latency (ms):
         min:                                    1.53
         avg:                                   15.05
         max:                                  239.44
         95th percentile:                       27.66
         sum:                              1919801.02

Threads fairness:
    events (avg/stddev):           7970.1875/2.32
    execution time (avg/stddev):   119.9876/0.00

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 02:05:43] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 304.04 qps: 6111.21 (r/w/o: 4278.97/1222.56/609.68) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 376.41 qps: 7528.22 (r/w/o: 5269.76/1505.64/752.82) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 495.00 qps: 9898.49 (r/w/o: 6928.90/1979.60/990.00) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 557.30 qps: 11147.50 (r/w/o: 7803.30/2229.60/1114.60) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 535.60 qps: 10711.99 (r/w/o: 7498.39/2142.40/1071.20) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 715.80 qps: 14315.00 (r/w/o: 10020.60/2862.80/1431.60) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 836.60 qps: 16726.27 (r/w/o: 11708.68/3344.39/1673.20) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 725.60 qps: 14497.95 (r/w/o: 10147.97/2898.79/1451.20) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 965.70 qps: 19334.22 (r/w/o: 13534.42/3868.40/1931.40) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 803.50 qps: 16070.57 (r/w/o: 11249.15/3214.41/1607.01) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 769.60 qps: 15392.00 (r/w/o: 10774.40/3078.40/1539.20) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1052.60 qps: 21051.75 (r/w/o: 14736.36/4210.19/2105.19) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1139516
        write:                           325576
        other:                           162788
        total:                           1627880
    transactions:                        81394  (678.15 per sec.)
    queries:                             1627880 (13563.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      678.1537
    time elapsed:                        120.0229s
    total number of events:              81394

Latency (ms):
         min:                                    4.05
         avg:                                   23.59
         max:                                  253.07
         95th percentile:                       71.83
         sum:                              1919982.24

Threads fairness:
    events (avg/stddev):           5087.1250/34.30
    execution time (avg/stddev):   119.9989/0.00

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-06 02:07:43] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1102655
        write:                           0
        other:                           0
        total:                           1102655
    transactions:                        1102655 (110030.07 per sec.)
    queries:                             1102655 (110030.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      110030.0678
    time elapsed:                        10.0214s
    total number of events:              1102655

Latency (ms):
         min:                                    0.08
         avg:                                    0.14
         max:                                  145.90
         95th percentile:                        0.24
         sum:                               159240.14

Threads fairness:
    events (avg/stddev):           68915.9375/1951.32
    execution time (avg/stddev):   9.9525/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-06 02:07:53] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           18610
        other:                           0
        total:                           18610
    transactions:                        18610  (1859.03 per sec.)
    queries:                             18610  (1859.03 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1859.0304
    time elapsed:                        10.0106s
    total number of events:              18610

Latency (ms):
         min:                                    2.42
         avg:                                    8.60
         max:                                  115.61
         95th percentile:                       21.89
         sum:                               160000.64

Threads fairness:
    events (avg/stddev):           1163.1250/0.33
    execution time (avg/stddev):   10.0000/0.00

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-06 02:08:03] Starting K6 benchmarks...
[2025-06-06 02:08:03] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-06 02:08:03] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 12172 complete and 0 interrupted iterations
default   [  12% ] 80 VUs  00m01.0s/10m0s  012172/100000 shared iters

running (00m02.0s), 80/80 VUs, 27795 complete and 0 interrupted iterations
default   [  28% ] 80 VUs  00m02.0s/10m0s  027795/100000 shared iters

running (00m03.0s), 80/80 VUs, 43580 complete and 0 interrupted iterations
default   [  44% ] 80 VUs  00m03.0s/10m0s  043580/100000 shared iters

running (00m04.0s), 80/80 VUs, 59151 complete and 0 interrupted iterations
default   [  59% ] 80 VUs  00m04.0s/10m0s  059151/100000 shared iters

running (00m05.0s), 80/80 VUs, 75042 complete and 0 interrupted iterations
default   [  75% ] 80 VUs  00m05.0s/10m0s  075042/100000 shared iters

running (00m06.0s), 80/80 VUs, 90891 complete and 0 interrupted iterations
default   [  91% ] 80 VUs  00m06.0s/10m0s  090892/100000 shared iters
time="2025-06-06T02:08:10Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T02:08:10Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=8.63ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  15154.905157/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=4.88ms min=784.77µs med=4.34ms max=171.07ms p(90)=7.06ms p(95)=8.63ms
      { endpoint:postgres_insert }..............................................: avg=4.88ms min=784.77µs med=4.34ms max=171.07ms p(90)=7.06ms p(95)=8.63ms
      { expected_response:true }................................................: avg=4.88ms min=784.77µs med=4.34ms max=171.07ms p(90)=7.06ms p(95)=8.63ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 15155.056706/s

    EXECUTION
    iteration_duration..........................................................: avg=5.2ms  min=935.36µs med=4.55ms max=174.23ms p(90)=7.76ms p(95)=9.57ms
    iterations..................................................................: 100000 15154.905157/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.4 MB/s
    data_sent...................................................................: 26 MB  3.9 MB/s



running (00m06.6s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.5s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-06 02:08:11] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T02:08:11Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T02:08:11Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 14549 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m00.9s/10m0s  014549/100000 shared iters

running (00m02.0s), 80/80 VUs, 30630 complete and 0 interrupted iterations
default   [  31% ] 80 VUs  00m01.9s/10m0s  030630/100000 shared iters

running (00m03.0s), 80/80 VUs, 47020 complete and 0 interrupted iterations
default   [  47% ] 80 VUs  00m02.9s/10m0s  047020/100000 shared iters

running (00m04.0s), 80/80 VUs, 63481 complete and 0 interrupted iterations
default   [  63% ] 80 VUs  00m03.9s/10m0s  063481/100000 shared iters

running (00m05.0s), 80/80 VUs, 80138 complete and 0 interrupted iterations
default   [  80% ] 80 VUs  00m04.9s/10m0s  080138/100000 shared iters

running (00m06.0s), 80/80 VUs, 96176 complete and 0 interrupted iterations
default   [  96% ] 80 VUs  00m05.9s/10m0s  096176/100000 shared iters
time="2025-06-06T02:08:17Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T02:08:17Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=8.18ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  48123.58216/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=4.53ms min=657.47µs med=4.14ms max=19.75ms p(90)=6.78ms p(95)=8.17ms
      { endpoint:postgres_get }.............................................: avg=4.53ms min=673.32µs med=4.14ms max=19.75ms p(90)=6.78ms p(95)=8.18ms
      { expected_response:true }............................................: avg=4.53ms min=657.47µs med=4.14ms max=19.75ms p(90)=6.78ms p(95)=8.17ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 16057.395659/s

    EXECUTION
    iteration_duration......................................................: avg=4.87ms min=828.79µs med=4.37ms max=24.79ms p(90)=7.45ms p(95)=9.05ms
    iterations..............................................................: 100000 16041.194053/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.4 MB/s
    data_sent...............................................................: 13 MB  2.1 MB/s



running (00m06.2s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-06 02:08:17] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 2862 complete and 0 interrupted iterations
default   [   3% ] 80 VUs  00m01.0s/10m0s  002862/100000 shared iters

running (00m02.0s), 80/80 VUs, 14955 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m02.0s/10m0s  014955/100000 shared iters

running (00m03.0s), 80/80 VUs, 27380 complete and 0 interrupted iterations
default   [  27% ] 80 VUs  00m03.0s/10m0s  027380/100000 shared iters

running (00m04.0s), 80/80 VUs, 39928 complete and 0 interrupted iterations
default   [  40% ] 80 VUs  00m04.0s/10m0s  039929/100000 shared iters

running (00m05.0s), 80/80 VUs, 52822 complete and 0 interrupted iterations
default   [  53% ] 80 VUs  00m05.0s/10m0s  052822/100000 shared iters

running (00m06.0s), 80/80 VUs, 66508 complete and 0 interrupted iterations
default   [  67% ] 80 VUs  00m06.0s/10m0s  066508/100000 shared iters

running (00m07.0s), 80/80 VUs, 81406 complete and 0 interrupted iterations
default   [  81% ] 80 VUs  00m07.0s/10m0s  081409/100000 shared iters

running (00m08.0s), 80/80 VUs, 97655 complete and 0 interrupted iterations
default   [  98% ] 80 VUs  00m08.0s/10m0s  097655/100000 shared iters
time="2025-06-06T02:08:25Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=9.76ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  12214.012626/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=6.15ms min=748.68µs med=5.18ms max=756.51ms p(90)=8.21ms p(95)=9.76ms
      { endpoint:postgres_insert }..............................................: avg=6.15ms min=748.68µs med=5.18ms max=756.51ms p(90)=8.21ms p(95)=9.76ms
      { expected_response:true }................................................: avg=6.15ms min=748.68µs med=5.18ms max=756.51ms p(90)=8.21ms p(95)=9.76ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 12214.134766/s

    EXECUTION
    iteration_duration..........................................................: avg=6.47ms min=890.17µs med=5.4ms  max=757.04ms p(90)=8.85ms p(95)=10.7ms
    iterations..................................................................: 100000 12214.012626/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.1 MB/s
    data_sent...................................................................: 26 MB  3.2 MB/s



running (00m08.2s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m08.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-06 02:08:25] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T02:08:25Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T02:08:25Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T02:08:26Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T02:08:26Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T02:08:26Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T02:08:26Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 12982 complete and 0 interrupted iterations
default   [  13% ] 80 VUs  00m00.9s/10m0s  012982/100000 shared iters

running (00m02.0s), 80/80 VUs, 28638 complete and 0 interrupted iterations
default   [  29% ] 80 VUs  00m01.9s/10m0s  028638/100000 shared iters

running (00m03.0s), 80/80 VUs, 45336 complete and 0 interrupted iterations
default   [  45% ] 80 VUs  00m02.9s/10m0s  045336/100000 shared iters

running (00m04.0s), 80/80 VUs, 61970 complete and 0 interrupted iterations
default   [  62% ] 80 VUs  00m03.9s/10m0s  061970/100000 shared iters

running (00m05.0s), 80/80 VUs, 78959 complete and 0 interrupted iterations
default   [  79% ] 80 VUs  00m04.9s/10m0s  078959/100000 shared iters

running (00m06.0s), 80/80 VUs, 96017 complete and 0 interrupted iterations
default   [  96% ] 80 VUs  00m05.9s/10m0s  096017/100000 shared iters
time="2025-06-06T02:08:32Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T02:08:32Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=8.25ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  48163.539151/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=4.49ms min=514.75µs med=4.06ms max=49.38ms p(90)=6.82ms p(95)=8.25ms
      { endpoint:postgres_get }.............................................: avg=4.49ms min=514.75µs med=4.07ms max=49.38ms p(90)=6.82ms p(95)=8.25ms
      { expected_response:true }............................................: avg=4.49ms min=514.75µs med=4.06ms max=49.38ms p(90)=6.82ms p(95)=8.25ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 16070.728108/s

    EXECUTION
    iteration_duration......................................................: avg=4.87ms min=661.95µs med=4.3ms  max=50.15ms p(90)=7.61ms p(95)=9.31ms
    iterations..............................................................: 100000 16054.51305/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.4 MB/s
    data_sent...............................................................: 13 MB  2.1 MB/s



running (00m06.2s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-06 02:08:32] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Fri Jun  6 02:08:32 UTC 2025
Duration: 13 minutes and 32 seconds
Results saved to: sysbench_results_r5a.4xlarge_20250606_015500.txt
=====================================================================
[2025-06-06 02:08:32] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-06 02:08:32] Detailed results saved to: sysbench_results_r5a.4xlarge_20250606_015500.txt